package org.andrei.ppreader;

import org.andrei.ppreader.service.PPNovel;
import org.andrei.ppreader.service.PPNovelChapter;

public class MockData {
    static public PPNovel novel = new PPNovel();
    static {
        novel.desc = "知识就等于力量。所谓神，不过是强大一点的奥术师。带着一大堆知识的夏风穿越而来了。";
        novel.engineIndex = 0;
        novel.imgUrl = "https://fm.88dus.com/38/38089/38089s.jpg";
        novel.name = "奥术神座";
        novel.chapterUrl = "11";
        novel.currentChapterOffset = 3;
        novel.currentChapterIndex = 1;

        PPNovelChapter chapter = new PPNovelChapter();
        chapter.url = "1";
        chapter.name = "第一章  燃烧的火刑架abcdefghijklmnopqrstuvwxyz";
        chapter.text =  "浓烟滚滚，每吸一口都发出破烂风箱般粗重的声音，像是在灼烧着咽喉和肺部，夏风的意识很快就模糊起来。\n" +
                "\n" +
                "　　“不能，不能睡过去，会死的。”\n" +
                "\n" +
                "　　“清醒，必须清醒！”\n" +
                "\n" +
                "　　……\n" +
                "\n" +
                "　　无边无际的赤红颜色霍地暗淡，最深、最沉的漆黑浮现，夏风仿佛溺水的人般，挣扎着想要抓住每一个可以抓住的东西来帮助自己改变这无力飘荡的状态，摆脱这无法言喻的黑暗。\n" +
                "\n" +
                "　　忽然，前面亮起一点红彤彤的光芒，像是清晨的太阳升起。\n" +
                "\n" +
                "　　在它的照耀下，夏风觉得自己恢复了一点力量，然后拼了命似地向着红光靠拢。\n" +
                "\n" +
                "　　当夏风借助照耀，真切地迈出这一步后，光芒越来越亮，由赤红转为纯白，将黑暗洞彻地支离破碎，瞬间消褪。\n" +
                "\n" +
                "　　“呼。”夏风猛地坐起，大口大口地喘着气，自己竟然梦到了一场可怕的火灾，而且在大火烧来之前，睡梦中的自己就因为吸入过多的浓烟而陷入昏迷，只能模糊、绝望地等待着火苗蔓延过来，就与以前几次鬼压床一样，明明知道在做梦，可想要挣脱，却没有力气，无法控制。\n" +
                "\n" +
                "　　这场梦异常地真实，让夏风心有余悸，加上并没有感觉到大火的存在，所以他呆滞地坐着，好久没有回过神来。\n" +
                "\n" +
                "　　随着急速跳动的心脏慢慢平稳，夏风精神凝聚，想起自己是在学校综合图书馆的通宵阅览室赶毕业论文，心中自嘲一句：“最近几天都是这种不规律的熬夜生活，难怪会做这么真实的噩梦。”\n" +
                "\n" +
                "　　可等夏风看向眼前，准备收拾参考书回寝室时，陌生而超乎想象的一幕，像是巨锤般击中了他的脑海，让他猛然呆住，一片空白。\n" +
                "\n" +
                "　　面前已经没有图书馆的漂亮木质书桌，没有了堆得乱七八糟的参考书，没有了准备输入电脑的论文草稿，只有一张黑乎乎、边角破烂发毛的毯子，而这张毯子就盖在自己身上。\n" +
                "\n" +
                "　　自己坐着的地方并不是图书馆的靠背椅子，而是一张狭窄的木床。\n" +
                "\n" +
                "　　“这是哪里？！”\n" +
                "\n" +
                "　　夏风虽然性格有些内向腼腆，反应不够快，但此时再怎么样都发现了种种不对之处：就算是真的着了火，自己被人送到了医院，这里也不像是医院！\n" +
                "\n" +
                "　　他内心一紧，慌忙看向四周，并且反射般忙不迭地往旁边站起。\n" +
                "\n" +
                "　　刚踩在地上，夏风就感觉到一阵极端的虚弱和眩晕，双脚一软，就要斜斜倒下。\n" +
                "\n" +
                "　　夏风慌忙伸出手，撑在床上，稳住自己，其脸色煞白、心神不宁，刚才这惊鸿一瞥，已经是将周围完全打量了一遍。\n" +
                "\n" +
                "　　一间破旧、狭窄的小屋，屋中除了身旁这张木床之外，只有一张随时都可能会散架的木桌，两张还算完好的凳子，一个破了洞的板条箱，而摇摇欲坠的木门另外一边，则有一个看不出本来颜色的火炉和吊在火炉上的瓦罐，火炉下的木柴已经不知熄灭了多久，没有半点热度传出。\n" +
                "\n" +
                "　　一切都是如此的陌生，夏风根本无法判断自己身在哪里，而不停涌现的虚弱感更是让夏风脑海一片混乱：\n" +
                "\n" +
                "　　“这到底是哪里？！”\n" +
                "\n" +
                "　　“身体就像是才大病了一场，与读高中那次肺炎刚刚消去的感觉很像。”\n" +
                "\n" +
                "　　……\n" +
                "\n" +
                "　　无数的想法在脑海中回荡，可夏风从来没有遇见过这种奇怪到了极点的事情，有点内向的性格让他一时竟然不知接下来该怎么做，浓浓的恐慌急速发酵着。\n" +
                "\n" +
                "　　唯一值得感谢的是，并没有任何讨厌的事物出现，让夏风能够习惯性地深呼吸了几次，慢慢地平复着恐慌，这时小屋外远远传来高喊声：\n" +
                "\n" +
                "　　“烧女巫了！阿得让教堂要烧女巫了！”\n" +
                "\n" +
                "　　“大家快去！”\n" +
                "\n" +
                "　　“烧死那该死的、邪恶的女巫！”\n" +
                "\n" +
                "　　恐惧和兴奋两种截然相反的情绪在奇怪的口音中明显地流露，夏风被打断了恐慌，好奇起来，自语了一句：“女巫？这里究竟是什么世界？”\n" +
                "\n" +
                "　　作为一名喜好小说的成年人，那种不好的预感在夏风心里隐隐产生，可还没来得及深思，哐当一声，可怜的破烂木门就被人一下撞开，一名十二三岁的男孩冲了进来。\n" +
                "\n" +
                "　　“路西恩大哥……”留着褐色短发，穿着齐膝亚麻上衣的男孩看到站在床边的夏风，意外而惊喜，“你醒了？”\n" +
                "\n" +
                "　　夏风看着这不同于现代风格的衣服，麻木地点着头，脑子里乱糟糟地产生一个荒谬的念头：“路西恩、女巫、教堂、烧死，莫非我真的穿越了，而且还是穿越到了欧洲中世纪猎杀女巫的黑暗时代？”\n" +
                "\n" +
                "　　事情总是朝着坏的方向发展，墨菲定律冷酷地提醒着夏风，男孩的发色，穿着的脏旧亚麻衣服，都在印证着这一点，至于男孩说的语言，夏风身体本能地可以听懂，也似乎能够运用，只不过距离语言学家还有很遥远距离的他，无法判断是哪种语言。\n" +
                "\n" +
                "　　见夏风魂不守舍，脸上有着几道黑灰污痕的小男孩并不奇怪：“妈妈总是不肯相信我，半夜还偷偷哭泣，哭得眼睛都肿了，一直念叨着可怜的小伊文斯，就像路西恩大哥你已经被埋在了墓园里面一样。”\n" +
                "\n" +
                "　　“爸爸被吵得没办法，一大早就找西蒙家那坏小子送信去维恩爵士的庄园，让哥哥想办法回来一次，他已经是见习的骑士侍从了，善堂的医生可不敢在他面前坚持那离谱的、好笑的价钱。”\n" +
                "\n" +
                "　　说起自己成为见习骑士侍从的哥哥，小男孩下巴微抬，有一种由衷的自豪。\n" +
                "\n" +
                "　　“不过，现在好了，他们输了，我是对的，路西恩大哥你怎么可能会有事！”\n" +
                "\n" +
                "　　边说，他边拉着夏风的手臂：“走，路西恩大哥，快去教堂广场看烧女巫，就是那个害得你被教堂守卫抓去审问了一夜的可恶女巫！”\n" +
                "\n" +
                "　　适逢大变，正想自己安静思考一下人生的夏风，本来不想跟着这小男孩去凑热闹，而且直接烧死一位活人，实在是自诩为还算良善的夏风无法接受的事情，既然自己无力阻止，那就还是不要目睹得好，可小男孩最后的那句话，却让夏风一下惊住：“这女巫和我有牵连？”\n" +
                "\n" +
                "　　于是夏风想法一变，收敛住惊讶，任由小男孩拉住，跌跌撞撞往阿得让教堂奔去。\n" +
                "\n" +
                "　　一路之上，夏风抓住机会打量着前往阿得让教堂的人们。\n" +
                "\n" +
                "　　天气比较暖和，男子基本穿着短窄衣袖的亚麻上衣，同色长裤和无跟鞋，女的则是乏味单一的长裙，裙子上往往缝合着一个大大的口袋，共同之处是简朴和破旧。\n" +
                "\n" +
                "　　大部分上的褐发棕瞳中掺杂金发、红发、黑发、碧眼、红瞳、蓝眼等，五官深刻，很有立体感。\n" +
                "\n" +
                "　　“难道真的是中世纪？”夏风看了看自身，一样的亚麻短上衣，一样的长裤，一样的无跟鞋。\n" +
                "\n" +
                "　　从破旧、低矮的贫民屋子聚集区出来没多久，就看到一座不大但庄严气派的教堂，半圆拱顶高耸，一个巨大的白色十字架钉在上面，下方的窗户则非常窄小。\n" +
                "\n" +
                "　　广场上已经围着很多人，小男孩拉着夏风左钻右闪，不停往前挤着，引得不少人怒气勃勃地看过来，只是碍于这里是教堂广场，不敢揍这两个混蛋。\n" +
                "\n" +
                "　　挤了没多久，夏风眼前豁然开朗，原来已经是挤到了最前面一层。";

        novel.chapters.add(chapter);
        chapter = new PPNovelChapter();
        chapter.url="2";
        chapter.name = "第二章  随自己而来的";
        chapter.text = " 傍晚时分的阳光洞穿一朵朵赤红色的云彩，照在静穆的阿得让教堂广场上，主教手中举着的小太阳已经失去明亮的光辉，被他挂在胸前，转身往教堂之内走去。\n" +
                "\n" +
                "    广场中央，颇为美丽的黑袍女巫已经被烧成了灰烬，但疯狂的笑声和诅咒仿佛还在回荡，让不少人忍不住哆嗦了一下，看了看四周，然后跟着主教和牧师们走进教堂，在主的关注下忏悔着自己的罪行，诚心地做着祈祷。\n" +
                "\n" +
                "    夺目的白光似乎还在眼前，其蕴含着的神圣而磅礴的力量仿佛还能依稀感觉，路西恩在这冲击之下，已经接受了自己的身份，将过往的一切深深埋葬在心中，不敢露出丝毫异样。\n" +
                "\n" +
                "    “神术的力量好强大，不知我有没有机会学到？”\n" +
                "\n" +
                "    路西恩身心震撼地想着，没有普通人该有的敬畏，突然，一股巨大的力量拍在了路西恩的左肩，拍得他不由自主往左边倾倒，险些就站立不稳。\n" +
                "\n" +
                "    “噢，我可怜的小伊文斯，你总算没事了，这都是主的庇佑，我还以为你会跟你父亲那样，病倒了就再也没能站起来，感谢主，让这么棒的好小伙能继续活着。”\n" +
                "\n" +
                "    路西恩被这么一拍，已经从震撼失神中清醒过来，看到一位足有两个自己宽的褐发大婶站在旁边，一边抹着眼泪，一边用可以媲美熊掌攻击的右手频频拍着自己的肩膀。\n" +
                "\n" +
                "    稍稍闪开，免得自己被拍得吐血，路西恩张了张嘴，却发现一句话也说不出来，因为：“这位大婶该怎么称呼？似乎我的全名应该是路西恩?伊文斯？”\n" +
                "\n" +
                "    路西恩这一躲，让那位大婶更加悲伤：“可怜的小伊文斯，你一定是病得迷糊了，你看这小脸蛋，瘦得都可以看见骨头了……”\n" +
                "\n" +
                "    念叨中，路西恩尴尬无比，自己穿越而来，除了能听懂、能说这里的语言，什么记忆都没有继承，要是应对错误的话，很可能被人误会为魔鬼附身，当然，从某种意义来讲，现在的路西恩确实是被魔鬼侵占了灵魂。\n" +
                "\n" +
                "    好在这时，旁边站着的一位中年男子拍了拍胖大婶，安抚道：“艾丽萨，小伊文斯刚刚才好，精神一定很虚弱，你不要吵他。艾文，扶着你妈妈，我们一起回家。”\n" +
                "\n" +
                "    这位中年男子身材很瘦，背微微弓着，有一头略显花白的金色短发，被时间刻上了沧桑的脸上依稀可以看到年轻时的英俊。\n" +
                "\n" +
                "    但在路西恩眼中，这位中年大叔此时就像一位带着洁白光环的天使，将自己从尴尬、紧张中脱离的天使。\n" +
                "\n" +
                "    “艾丽萨大婶，我已经全好了，只是还有点头晕。”路西恩筹措着词语，免得露出马脚。\n" +
                "\n" +
                "    那位拉着路西恩来看烧女巫的小男孩艾文半扶着他**妈，扮着鬼脸：“路西恩大哥可不是那种生一次病就死掉的懦夫，只有你还当他是需要照顾的小不点。”\n" +
                "\n" +
                "    艾丽萨大婶抹着眼泪：“小伊文斯，看到你好起来，我就放心了，都怪那该死的、邪恶的、已经下地狱的女巫。”\n" +
                "\n" +
                "    被艾文扶着，艾丽萨大婶一边慢慢向前走着，一边唠叨：“她刚刚搬到你旁边屋子的时候，是多么的文静美丽，多么的温文尔雅，我还想着小约翰要是能够娶到这样的姑娘，那就是主的恩赐，可是，可她竟然是女巫，而且还跑去墓园偷死者的遗骸来施展邪恶的魔法，幸好主的荣光照耀一切，当时有裁判所的守夜人就在墓园，将她直接抓住，要不然被她准备好邪恶的魔法，我们阿得让区不知要死多少人……”\n" +
                "\n" +
                "    与中年大叔一起走在后面，从艾丽萨大婶的唠叨里，路西恩大概知道了事情的经过，那位女巫是在去墓园偷尸体的时候被教会的守夜人抓住，而自己作为她的邻居，也被教会找去审问，中间教会可能用了一些神术上的手段，在排除了那位真正路西恩嫌疑的同时，也让他受到了精神或是肉体上的伤害，于是得了一场大病而死去，所以才能让自己附身。\n" +
                "\n" +
                "    见路西恩没有说话，中年大叔拍了拍路西恩的肩膀，悄声安慰：“艾丽萨就是这样唠叨，你当做没听见就好了。”\n" +
                "\n" +
                "    路西恩不知该说什么，只能点了点头。\n" +
                "\n" +
                "    中年大叔看着艾丽萨大婶的背影，悄悄叹了口气：“哎，当年的艾丽萨可是一位纯洁而热情的美丽姑娘，但自从生了小约翰之后，就像是被魔鬼诅咒了一样，短短一年就变成了现在的样子。”\n" +
                "\n" +
                "    他一副似乎充满人生感慨的模样，目光颇为深邃，然后顿了顿：“我再也打不过她了。”\n" +
                "\n" +
                "    刚穿越过来，又亲眼看见和体会到了神术的威力，路西恩受到极大冲击，正处在心神不宁中，因此只是勉强笑了笑，没有直接回答，而且他还不知道这位大叔该怎么称呼。\n" +
                "\n" +
                "    也许是大叔回忆得太过入神，没有注意到声音的控制，艾丽萨哼了一声：“乔尔，你这位充满理想和激情的吟游诗人，千辛万苦到阿尔托来追寻音乐梦想的青年，还不是也变成了整天醉醺醺的酒鬼。”\n" +
                "\n" +
                "    乔尔讪讪笑了笑：“阿尔托是圣咏之城，每天不知多少追寻音乐梦想的年轻人到来，可其中能够成功的又有多少？艾丽萨，再说，自从小约翰开始锻炼以来，我不就戒酒了吗？”\n" +
                "\n" +
                "    艾丽萨大婶回头瞪了他一眼：“幸好有主的庇佑，你还知道我们的希望都在约翰和艾文身上。要不是小约翰天天锻炼，怎么可能被维恩爵士挑中，去他的庄园进行正规的骑士训练，要是他能激发血脉内的‘神恩’，成为真正的骑士，那就能被大公封为勋爵，成为尊敬的贵族。”\n" +
                "\n" +
                "    严厉的目光让乔尔缩了缩肩膀，但艾丽萨很快注意到了一边路西恩的恍惚：“哦，抱歉，小伊文斯，婶婶不是故意提起这件事情的，你也很有天赋，只是，只是没有从小开始锻炼……”\n" +
                "\n" +
                "    发现自己越说越是触痛路西恩内心的伤痕，艾丽萨忙闭上了嘴，用眼神示意乔尔说话。\n" +
                "\n" +
                "    乔尔哈哈大笑，再次拍了拍路西恩的肩膀：“我们的小伊文斯怎么可能这么脆弱，他可是要继承他乔尔叔叔音乐家梦想的男人。”\n" +
                "\n" +
                "    心神动荡不安的路西恩只好咧嘴笑了笑：“是啊，我的梦想是成为音乐家。”\n" +
                "\n" +
                "    见路西恩没什么异状，艾丽萨又继续唠叨着种种琐事，倒是让路西恩对自己所处的这个城市有了进一步的了解。\n" +
                "\n" +
                "    这是一个叫做阿尔托的大城，在黑暗山脉附近，有圣咏之城的称号，繁荣，充满机会。\n" +
                "\n" +
                "    目前自己居住的地方，是阿尔托的贫民聚集地阿得让区，并且自己似乎因为几天的大病，丢掉了在市场区帮忙搬运货物的固定工作。\n" +
                "\n" +
                "    很快，四人走到了路西恩所在的小屋前。\n" +
                "\n" +
                "    艾丽萨大婶本来想邀请路西恩去她家吃晚饭，但急需要安静的路西恩委婉地拒绝了她。\n" +
                "\n" +
                "    分开时，艾文悄悄而好奇地问着路西恩：“路西恩大哥，你的梦想什么时候变成音乐家了？”\n" +
                "\n" +
                "    “刚才。”路西恩麻木地动了动嘴巴。\n" +
                "\n" +
                "    艾文长长地喔了一声。\n" +
                "\n" +
                "    进了屋，将门反锁，路西恩神不守舍地坐下，手肘支在木桌上，而脑袋则深深地埋在手肘里。\n" +
                "\n" +
                "    “我竟然穿越了！”\n" +
                "\n" +
                "    “而且还是这种有着非人力量的世界。”\n" +
                "\n" +
                "    “一不小心就会被绑在火刑架上活活烧死。”\n" +
                "\n" +
                "    刚才目睹女巫凄惨下场而产生的情绪，在没有人的时候，终于爆发了出来，路西恩是又惊又吓又怕。\n" +
                "\n" +
                "    当然，作为一名没有经历过多少大事的家伙，路西恩虽然有些内向，遇到事情容易慌张，但在那巨大压力面前，竟然还是保持住了冷静，直到回来才压制不住。\n" +
                "\n" +
                "    不得不说，环境和遭遇最为磨砺人。\n" +
                "\n" +
                "    随着时间推移，黑暗渐渐降临，路西恩也适应了恐惧，镇定下来，既然都已经穿越，再惶恐、再担心、再害怕，都于事无补，只能小心翼翼地见一步走一步，这次再死掉，可不一定能再有穿越的好事情了。\n" +
                "\n" +
                "    情绪恢复，压住对父母、朋友的思念和担心，刚想规划一下人生，路西恩立刻就感觉到汹涌袭来的饥饿感，胃里面就像有一把火在燃烧，口水不停地分泌。\n" +
                "\n" +
                "    吞了吞口水，填饱肚子是当务之急，路西恩中断了思考，往屋子里唯一能存放东西的板条箱走去。\n" +
                "\n" +
                "    破旧的箱子里，除了一些衣物，路西恩看到了两条黑色的面包状食物，以及七个闪烁着金属光芒的黄铜钱币。\n" +
                "\n" +
                "    胃袋已经代替了路西恩的大脑，他没有多余的精力去想别的事情，拿起一条黑面包就啃了下去。\n" +
                "\n" +
                "    喀嚓一声，路西恩连忙用手捂住嘴巴，牙齿差点给崩掉了，这究竟是面包还是木棍？\n" +
                "\n" +
                "    闻了闻，路西恩勉强肯定它确实是面包，只是硬得能打晕成年人。\n" +
                "\n" +
                "    强忍住饥饿，路西恩从板条箱里又翻出了打火石，失败了几次后，总算将火炉下的木材点燃，规规矩矩地开始烤起了面包。\n" +
                "\n" +
                "    “红烧肉、香辣鸡翅、粉蒸牛肉、宫保鸡丁……”一边烤着面包，路西恩一边念叨着美食，口水止不住地泛起。\n" +
                "\n" +
                "    黑面包稍微松软了一点，路西恩就忍不住地啃了起来，那恐怖的味道，简直就像是在咀嚼着木屑。\n" +
                "\n" +
                "    可路西恩还是狼吞虎咽地吃着，一边吃，一边忍不住哀叹：“要是每天都吃这样的食物，那还不如死了好，不行，一定要赚到钱，一定要摆脱这种贫民的生活。”\n" +
                "\n" +
                "    “要是能学会神术，成为主教和牧师……”漫无边际肖想中，路西恩想起了在教堂前看到的衣冠楚楚的主教和牧师，想起了那非人的力量和他们由此而来的高贵地位，忍不住怦然心动，“可是，我这样的状况，去教会不是找死吗？不知道还有没有其他获得非人超凡力量的途径？比如那个神恩？”\n" +
                "\n" +
                "    “如果不能获得这种力量，我学的东西，在这个世界派得上用场吗？”\n" +
                "\n" +
                "    止住了饥饿，路西恩开始认真地分析起自己的生存之路，但刚回想学过的知识时，路西恩突然发生，脑海里像是多了些什么东西。\n" +
                "\n" +
                "    仔细一察觉，路西恩忍不住睁大了双眼：“这不是图书馆里的书吗？它们也跟着穿越了？”\n" +
                "\n" +
                "    自己的脑海里竟然有整个综合图书馆的书籍，它们不像是记忆，而仿佛是投影，一本本分门别类的放好，供路西恩翻阅。\n" +
                "\n" +
                "    好奇的路西恩随意地翻阅着图书，可疑惑地发生，绝大部分图书竟然无法打开。";
        novel.chapters.add(chapter);

        chapter = new PPNovelChapter();
        chapter.url="3";
        chapter.name = "第四章  随自己而来的";
        novel.chapters.add(chapter);

    }


}
